app/controllers/cards_controller.rb

  def index

    if user_signed_in?
      #Loads default sort case instead of .all
      @cards = current_user.cards.order(sort_column + " " + sort_direction)
---
SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = ?  [["user_id", 9]]

  def create
    @card = current_user.cards.create(card_params)
---
INSERT INTO "cards" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "pokemon"], ["content", "pikachu"], ["created_at", "2019-03-20 07:50:17.433222"], ["updated_at", "2019-03-20 07:50:17.433222"], ["user_id", 9]]

  def update
    respond_to do |format|
      if @card.update(card_params)
---
UPDATE "cards" SET "content" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["content", "raichu2"], ["updated_at", "2019-03-20 08:02:31.088314"], ["id", 3]]