app/controllers/videogames_controller.rb

SELECT "videogames".* FROM "videogames" WHERE "videogames"."user_id" = ?  [["user_id", 1]]
---
  def index

    if user_signed_in?
        @videogames = current_user.videogames.all

INSERT INTO "videogames" ("title", "publisher", "platform", "year", "upc", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["publisher", ""], ["platform", ""], ["year", ""], ["upc", ""], ["created_at", "2019-02-16 07:11:03.715011"], ["updated_at", "2019-02-16 07:11:03.715011"], ["user_id", 3]]
---
  def create
      @videogame = current_user.videogames.create(videogame_params)

UPDATE "videogames" SET "title" = ?, "publisher" = ?, "platform" = ?, "year" = ?, "condition" = ?, "upc" = ?, "updated_at" = ? WHERE "videogames"."id" = ?  [["title", "Undertale"], ["publisher", "Toby Fox "], ["platform", "PC"], ["year", "2015"], ["condition", 5], ["upc", "850055007222 "], ["updated_at", "2019-03-09 07:53:42.367648"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @videogame.update(videogame_params)

DELETE FROM "videogames" WHERE "videogames"."id" = ?  [["id", 15]]
---
  def destroy
    @videogame.destroy

SELECT  "videogames".* FROM "videogames" WHERE "videogames"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_videogame
      @videogame = Videogame.find(params[:id])