app/controllers/vinyls_controller.rb

SELECT "vinyls".* FROM "vinyls" WHERE "vinyls"."user_id" = ?  [["user_id", 5]]
---
  def index

    if user_signed_in?
        @vinyls = current_user.vinyls.all

INSERT INTO "vinyls" ("title", "artist", "year", "condition", "label", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", "2"], ["artist", "3"], ["year", "4"], ["condition", 5], ["label", "6"], ["created_at", "2019-03-20 08:38:18.396613"], ["updated_at", "2019-03-20 08:38:18.396613"], ["user_id", 9]]
---
  def create
      @vinyl = current_user.vinyls.create(vinyl_params)

DELETE FROM "vinyls" WHERE "vinyls"."id" = ?  [["id", 3]]
---
  def destroy
    @vinyl.destroy

SELECT  "vinyls".* FROM "vinyls" WHERE "vinyls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_vinyl
      @vinyl = Vinyl.find(params[:id])