app/models/upload.rb

INSERT INTO "uploads" ("title", "publisher", "year", "condition", "upc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Far Cry 1"], ["publisher", "Ubisoft"], ["year", 2012], ["condition", 5], ["upc", 0], ["created_at", "2019-03-10 08:10:12.952980"], ["updated_at", "2019-03-10 08:10:12.952980"]]
---
  def self.import(file)
    CSV.foreach(file.path, headers: true, header_converters: :symbol) do |row|
      Upload.create! row.to_hash